
open import OpsNotation
open import HEq

open import TT.Syntax

module TT.Typing where

data _⊢_≡_    : (Γ : Ctx) {d : Dim} (A B : Typ Γ d) → Set
data _⊢_≡_∷_  : (Γ : Ctx) {d : Dim} (t u : Trm Γ d) (A : Typ Γ d) → Set

infix 4 _⊢_≡_
infix 4 _⊢_≡_∷_

data _⊢ : (Γ : Ctx) → Set
data _⊢_ : (Γ : Ctx) {d : Dim} (A : Typ Γ d) → Set
data _⊢_∷_ : (Γ : Ctx) {d : Dim} (t : Trm Γ d) (A : Typ Γ d) → Set

infix 4 _⊢
infix 4 _⊢_
infix 4 _⊢_∷_

data _⊢_≡_ where
  -- generators : none at the moment

  -- reflexive closure
  refl : {d : Dim}
       → {Γ : Ctx}     → Γ ⊢
       → {A : Typ Γ d} → Γ ⊢ A
       → Γ ⊢ A ≡ A

  -- transitive closure
  trans : {d : Dim}
        → {Γ : Ctx}     → Γ ⊢
        → {A : Typ Γ d} → Γ ⊢ A
        → {B : Typ Γ d} → Γ ⊢ B
        → {C : Typ Γ d} → Γ ⊢ C
        → Γ ⊢ A ≡ B
        → Γ ⊢ B ≡ C
        → Γ ⊢ A ≡ C

  -- symmetric closure
  symm : {d : Dim}
       → {Γ : Ctx}     → Γ ⊢
       → {A : Typ Γ d} → Γ ⊢ A
       → {B : Typ Γ d} → Γ ⊢ B
       → Γ ⊢ A ≡ B
       → Γ ⊢ B ≡ A

  -- congruence closure: minimal dependent type theory
  Π₁ : {d₀ d₁ : Dim}
     → {Γ : Ctx}            → Γ ⊢
     → {A B : Typ Γ d₀}     → Γ ⊢ A → Γ ⊢ B → Γ ⊢ A ≡ B
     → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
     → Γ ⊢ Π A F ≡ Π B (F [ rew A B ])
  Π₂ : {d₀ d₁ : Dim}
     → {Γ : Ctx}              → Γ ⊢
     → {A : Typ Γ d₀}         → Γ ⊢ A
     → {F G : Typ (Γ , A) d₁} → Γ , A ⊢ F
                              → Γ , A ⊢ G
                              → Γ , A ⊢ F ≡ G
     → Γ ⊢ Π A F ≡ Π A G
  E  : {d : Dim}
     → {Γ : Ctx}         → Γ ⊢
     → {t u : Trm Γ +0d} → Γ ⊢ t ∷ U d
                         → Γ ⊢ u ∷ U d
                         → Γ ⊢ t ≡ u ∷ U d
     → Γ ⊢ E d t ≡ E d u

  -- congruence closure: equality
  ≃₁ : {Γ : Ctx}         → Γ ⊢
     → {A B : Typ Γ +0d} → Γ ⊢ A
                         → Γ ⊢ B
                         → Γ ⊢ A ≡ B
     → {t : Trm Γ +0d}   → Γ ⊢ t ∷ A
     → {u : Trm Γ +0d}   → Γ ⊢ u ∷ A
     → Γ ⊢ ≃ A t u ≡ ≃ B t u
  ≃₂ : {Γ : Ctx}           → Γ ⊢
     → {A : Typ Γ +0d}     → Γ ⊢ A
     → {t₁ t₂ : Trm Γ +0d} → Γ ⊢ t₁ ∷ A
                           → Γ ⊢ t₂ ∷ A
                           → Γ ⊢ t₁ ≡ t₂ ∷ A
     → {u : Trm Γ +0d} → Γ ⊢ u ∷ A
     → Γ ⊢ ≃ A t₁ u ≡ ≃ A t₂ u
  ≃₃ : {Γ : Ctx}           → Γ ⊢
     → {A : Typ Γ +0d}     → Γ ⊢ A
     → {t : Trm Γ +0d}     → Γ ⊢ t ∷ A
     → {u₁ u₂ : Trm Γ +0d} → Γ ⊢ u₁ ∷ A
                           → Γ ⊢ u₂ ∷ A
                           → Γ ⊢ u₁ ≡ u₂ ∷ A
     → Γ ⊢ ≃ A t u₁ ≡ ≃ A t u₂

data _⊢_≡_∷_ where
  -- generators: minimal dependent type theory
  β : {d₀ d₁ : Dim}
    → {Γ : Ctx}            → Γ ⊢
    → {A : Typ Γ d₀}       → Γ ⊢ A
    → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
    → {f : Trm (Γ , A) d₁} → Γ , A ⊢ f ∷ F
    → {B : Typ Γ d₀}       → Γ ⊢ B
    → {t : Trm Γ d₀}       → Γ ⊢ t ∷ B
    → Γ ⊢ A ≡ B
    → Γ ⊢  · A F (ƛ A F f) B t
        ≡ f [ sub t ]
        ∷ F [ sub t ]
  η : {d₀ d₁ : Dim}
    → {Γ : Ctx}            → Γ ⊢
    → {A : Typ Γ d₀}       → Γ ⊢ A
    → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
    → {f : Trm Γ d₁}       → Γ ⊢ f ∷ Π A F
    → Γ ⊢  f
        ≡ ƛ A F (· (A [ wkn A ]) (F [ wkn A , A ]) (f [ wkn A ]) (A [ wkn A ]) (` (A [ wkn A ]) z))
        ∷ Π A F
        
  -- generators: proof-irrelevant propositions
  irrel : {Γ : Ctx}       → Γ ⊢
        → {A : Typ Γ -1d} → Γ ⊢ A
        → {t : Trm Γ -1d} → Γ ⊢ t ∷ A
        → {u : Trm Γ -1d} → Γ ⊢ u ∷ A
        → Γ ⊢ t ≡ u ∷ A

  -- generators: equality
  ≃ind-β : {d₀ : Dim}
         → {Γ : Ctx}                                → Γ ⊢
         → {A₁ : Typ Γ +0d}                         → Γ ⊢ A₁
         → {A₂ : Typ (Γ , A₁) +0d}                  → Γ , A₁ ⊢ A₂
         → {t₁ : Trm Γ +0d}                         → Γ ⊢ t₁ ∷ A₁
         → {t₂ : Trm (Γ , A₁) +0d}                  → Γ , A₁ ⊢ t₂ ∷ A₂
         → {F : Typ (Γ , A₁ , ≃ A₂ t₂ (` A₂ z)) d₀} → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F
         → {f : Trm Γ d₀}                           → Γ ⊢ f ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
         → A₁ [ wkn A₁ ] ≅ A₂
         → t₁ [ wkn A₁ ] ≅ t₂
         → Γ ⊢  ≃ind A₁ A₂ t₁ t₂ F f t₁ (≃rfl A₁ t₁)
             ≡ f
             ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]

  -- reflexive closure
  refl : {d : Dim}
       → {Γ : Ctx}     → Γ ⊢
       → {A : Typ Γ d} → Γ ⊢ A
       → {t : Trm Γ d} → Γ ⊢ t ∷ A
       → Γ ⊢ t ≡ t ∷ A

  -- transitive closure
  trans : {d : Dim}
        → {Γ : Ctx}     → Γ ⊢
        → {A : Typ Γ d} → Γ ⊢ A
        → {s : Trm Γ d} → Γ ⊢ s ∷ A
        → {t : Trm Γ d} → Γ ⊢ t ∷ A
        → {u : Trm Γ d} → Γ ⊢ u ∷ A
        → Γ ⊢ s ≡ t ∷ A
        → Γ ⊢ t ≡ u ∷ A
        → Γ ⊢ s ≡ u ∷ A

  -- symmetric closure
  symm : {d : Dim}
       → {Γ : Ctx}     → Γ ⊢
       → {A : Typ Γ d} → Γ ⊢ A
       → {t : Trm Γ d} → Γ ⊢ t ∷ A
       → {u : Trm Γ d} → Γ ⊢ u ∷ A
       → Γ ⊢ t ≡ u ∷ A
       → Γ ⊢ u ≡ t ∷ A

  -- congruence closure
  conv : {d : Dim}
       → {Γ : Ctx}       → Γ ⊢
       → {A B : Typ Γ d} → Γ ⊢ A
                         → Γ ⊢ B
                         → Γ ⊢ A ≡ B
       → {t : Trm Γ d}   → Γ ⊢ t ∷ A
       → {u : Trm Γ d}   → Γ ⊢ u ∷ A
                         → Γ ⊢ t ≡ u ∷ A
       → Γ ⊢ t ≡ u ∷ B

  -- congruence closure: minimal dependent type theory
  ƛ₁ : {d₀ d₁ : Dim}
     → {Γ : Ctx}            → Γ ⊢
     → {A B : Typ Γ d₀}     → Γ ⊢ A
                            → Γ ⊢ B
                            → Γ ⊢ A ≡ B
     → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
     → {f : Trm (Γ , A) d₁} → Γ , A ⊢ f ∷ F
     → Γ ⊢ ƛ A F f ≡ ƛ B (F [ rew A B ]) (f [ rew A B ]) ∷ Π A F
  ƛ₂ : {d₀ d₁ : Dim}
     → {Γ : Ctx}              → Γ ⊢
     → {A : Typ Γ d₀}         → Γ ⊢ A
     → {F G : Typ (Γ , A) d₁} → Γ , A ⊢ F
                              → Γ , A ⊢ G
                              → Γ , A ⊢ F ≡ G
     → {f : Trm (Γ , A) d₁}   → Γ , A ⊢ f ∷ F
     → Γ ⊢ ƛ A F f ≡ ƛ A G f ∷ Π A F
  ƛ₃ : {d₀ d₁ : Dim}
     → {Γ : Ctx}              → Γ ⊢
     → {A : Typ Γ d₀}         → Γ ⊢ A
     → {F : Typ (Γ , A) d₁}   → Γ , A ⊢ F
     → {f g : Trm (Γ , A) d₁} → Γ , A ⊢ f ∷ F
                              → Γ , A ⊢ g ∷ F
                              → Γ , A ⊢ f ≡ g ∷ F
     → Γ ⊢ ƛ A F f ≡ ƛ A F g ∷ Π A F
  ·₁ : {d₀ d₁ : Dim}
     → {Γ : Ctx}            → Γ ⊢
     → {A C : Typ Γ d₀}     → Γ ⊢ A
                            → Γ ⊢ C
                            → Γ ⊢ A ≡ C
     → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
     → {f : Trm Γ d₁}       → Γ ⊢ f ∷ Π A F
     → {B : Typ Γ d₀}       → Γ ⊢ B
     → {t : Trm Γ d₀}       → Γ ⊢ t ∷ B
     → Γ ⊢ · A F f B t ≡ · C (F [ rew A C ]) f B t ∷ F [ sub t ]
  ·₂ : {d₀ d₁ : Dim}
     → {Γ : Ctx}           → Γ ⊢
     → {A : Typ Γ d₀}         → Γ ⊢ A
     → {F G : Typ (Γ , A) d₁} → Γ , A ⊢ F
                           → Γ , A ⊢ G
                           → Γ , A ⊢ F ≡ G
     → {f : Trm Γ d₁}         → Γ ⊢ f ∷ Π A F
     → {B : Typ Γ d₀}         → Γ ⊢ B
     → {t : Trm Γ d₀}         → Γ ⊢ t ∷ B
     → Γ ⊢ · A F f B t ≡ · A G f B t ∷ F [ sub t ]
  ·₃ : {d₀ d₁ : Dim}
     → {Γ : Ctx}            → Γ ⊢
     → {A : Typ Γ d₀}       → Γ ⊢ A
     → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
     → {f g : Trm Γ d₁}     → Γ ⊢ f ∷ Π A F
                            → Γ ⊢ g ∷ Π A F
                            → Γ ⊢ f ≡ g ∷ Π A F
     → {B : Typ Γ d₀}       → Γ ⊢ B
     → {t : Trm Γ d₀}       → Γ ⊢ t ∷ B
     → Γ ⊢ · A F f B t ≡ · A F g B t ∷ F [ sub t ]
  ·₄ : {d₀ d₁ : Dim}
     → {Γ : Ctx}            → Γ ⊢
     → {A : Typ Γ d₀}       → Γ ⊢ A
     → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
     → {f : Trm Γ d₁}       → Γ ⊢ f ∷ Π A F
     → {B D : Typ Γ d₀}     → Γ ⊢ B
                            → Γ ⊢ D
                            → Γ ⊢ B ≡ D
     → {t : Trm Γ d₀}       → Γ ⊢ t ∷ B
     → Γ ⊢ · A F f B t ≡ · A F f D t ∷ F [ sub t ]
  ·₅ : {d₀ d₁ : Dim}
     → {Γ : Ctx}            → Γ ⊢
     → {A : Typ Γ d₀}       → Γ ⊢ A
     → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
     → {f : Trm Γ d₁}       → Γ ⊢ f ∷ Π A F
     → {B : Typ Γ d₀}       → Γ ⊢ B
     → {t u : Trm Γ d₀}     → Γ ⊢ t ∷ B
                            → Γ ⊢ u ∷ B
                            → Γ ⊢ t ≡ u ∷ B
     → Γ ⊢ · A F f B t ≡ · A F f B u ∷ F [ sub t ]

  -- congruence closure: equality
  ≃rfl₁ : {Γ : Ctx}         → Γ ⊢
        → {A B : Typ Γ +0d} → Γ ⊢ A → Γ ⊢ B → Γ ⊢ A ≡ B
        → {t : Trm Γ +0d}   → Γ ⊢ t ∷ A
        → Γ ⊢ ≃rfl A t ≡ ≃rfl B t ∷ ≃ A t t
  ≃rfl₂ : {Γ : Ctx}         → Γ ⊢
        → {A : Typ Γ +0d}   → Γ ⊢ A
        → {t u : Trm Γ +0d} → Γ ⊢ t ∷ A → Γ ⊢ u ∷ A → Γ ⊢ t ≡ u ∷ A
        → Γ ⊢ ≃rfl A t ≡ ≃rfl A u ∷ ≃ A t t
  ≃ind₁  : {d₀ : Dim}
         → {Γ : Ctx}                                   → Γ ⊢
         → {A₁ B₁ : Typ Γ +0d}                         → Γ ⊢ A₁
                                                       → Γ ⊢ B₁
                                                       → Γ ⊢ A₁ ≡ B₁
         → {A₂ : Typ (Γ , A₁) +0d}                     → Γ , A₁ ⊢ A₂
         → {t₁ : Trm Γ +0d}                            → Γ ⊢ t₁ ∷ A₁
         → {t₂ : Trm (Γ , A₁) +0d}                     → Γ , A₁ ⊢ t₂ ∷ A₂
         → {F : Typ (Γ , A₁ , ≃ A₂ t₂ (` A₂ z)) d₀}    → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F
         → {f : Trm Γ d₀}                              → Γ ⊢ f ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
         → {u : Trm Γ +0d}                             → Γ ⊢ u ∷ A₁
         → {p : Trm Γ -1d}                             → Γ ⊢ p ∷ ≃ A₁ t₁ u
         → A₁ [ wkn A₁ ] ≅ A₂
         → t₁ [ wkn A₁ ] ≅ t₂
         → Γ ⊢ ≃ind A₁ A₂ t₁ t₂ F f u p
             ≡ ≃ind B₁ (A₂ [ rew _ _ ]) t₁ (t₂ [ rew _ _ ]) (F [ rew _ _ , _ ]) f u p
             ∷ F [ sub u , _ ] [ sub p ]
  ≃ind₂  : {d₀ : Dim}
         → {Γ : Ctx}                                   → Γ ⊢
         → {A₁ : Typ Γ +0d}                            → Γ ⊢ A₁
         → {A₂ B₂ : Typ (Γ , A₁) +0d}                  → Γ , A₁ ⊢ A₂
                                                       → Γ , A₁ ⊢ B₂
                                                       → Γ , A₁ ⊢ A₂ ≡ B₂
         → {t₁ : Trm Γ +0d}                            → Γ ⊢ t₁ ∷ A₁
         → {t₂ : Trm (Γ , A₁) +0d}                     → Γ , A₁ ⊢ t₂ ∷ A₂
         → {F : Typ (Γ , A₁ , ≃ A₂ t₂ (` A₂ z)) d₀}    → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F
         → {f : Trm Γ d₀}                              → Γ ⊢ f ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
         → {u : Trm Γ +0d}                             → Γ ⊢ u ∷ A₁
         → {p : Trm Γ -1d}                             → Γ ⊢ p ∷ ≃ A₁ t₁ u
         → A₁ [ wkn A₁ ] ≅ A₂
         → t₁ [ wkn A₁ ] ≅ t₂
         → Γ ⊢ ≃ind A₁ A₂ t₁ t₂ F f u p
             ≡ ≃ind A₁ B₂ t₁ t₂ (F [ rew _ _ ]) f u p
             ∷ F [ sub u , _ ] [ sub p ]
  ≃ind₃  : {d₀ : Dim}
         → {Γ : Ctx}                                   → Γ ⊢
         → {A₁ : Typ Γ +0d}                            → Γ ⊢ A₁
         → {A₂ : Typ (Γ , A₁) +0d}                     → Γ , A₁ ⊢ A₂
         → {t₁ τ₁ : Trm Γ +0d}                         → Γ ⊢ t₁ ∷ A₁
                                                       → Γ ⊢ τ₁ ∷ A₁
                                                       → Γ ⊢ t₁ ≡ τ₁ ∷ A₁
         → {t₂ : Trm (Γ , A₁) +0d}                     → Γ , A₁ ⊢ t₂ ∷ A₂
         → {F : Typ (Γ , A₁ , ≃ A₂ t₂ (` A₂ z)) d₀}    → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F
         → {f : Trm Γ d₀}                              → Γ ⊢ f ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
         → {u : Trm Γ +0d}                             → Γ ⊢ u ∷ A₁
         → {p : Trm Γ -1d}                             → Γ ⊢ p ∷ ≃ A₁ t₁ u
         → A₁ [ wkn A₁ ] ≅ A₂
         → t₁ [ wkn A₁ ] ≅ t₂
         → Γ ⊢ ≃ind A₁ A₂ t₁ t₂ F f u p
             ≡ ≃ind A₁ A₂ τ₁ t₂ F f u p
             ∷ F [ sub u , _ ] [ sub p ]
  ≃ind₄  : {d₀ : Dim}
         → {Γ : Ctx}                                   → Γ ⊢
         → {A₁ : Typ Γ +0d}                            → Γ ⊢ A₁
         → {A₂ : Typ (Γ , A₁) +0d}                     → Γ , A₁ ⊢ A₂
         → {t₁ : Trm Γ +0d}                            → Γ ⊢ t₁ ∷ A₁
         → {t₂ τ₂ : Trm (Γ , A₁) +0d}                  → Γ , A₁ ⊢ t₂ ∷ A₂
                                                       → Γ , A₁ ⊢ τ₂ ∷ A₂
                                                       → Γ , A₁ ⊢ t₂ ≡ τ₂ ∷ A₂
         → {F : Typ (Γ , A₁ , ≃ A₂ t₂ (` A₂ z)) d₀}    → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F
         → {f : Trm Γ d₀}                              → Γ ⊢ f ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
         → {u : Trm Γ +0d}                             → Γ ⊢ u ∷ A₁
         → {p : Trm Γ -1d}                             → Γ ⊢ p ∷ ≃ A₁ t₁ u
         → A₁ [ wkn A₁ ] ≅ A₂
         → t₁ [ wkn A₁ ] ≅ t₂
         → Γ ⊢ ≃ind A₁ A₂ t₁ t₂ F f u p
             ≡ ≃ind A₁ A₂ t₁ τ₂ (F [ rew _ _ ]) f u p
             ∷ F [ sub u , _ ] [ sub p ]
  ≃ind₅  : {d₀ : Dim}
         → {Γ : Ctx}                                   → Γ ⊢
         → {A₁ : Typ Γ +0d}                            → Γ ⊢ A₁
         → {A₂ : Typ (Γ , A₁) +0d}                     → Γ , A₁ ⊢ A₂
         → {t₁ : Trm Γ +0d}                            → Γ ⊢ t₁ ∷ A₁
         → {t₂ : Trm (Γ , A₁) +0d}                     → Γ , A₁ ⊢ t₂ ∷ A₂
         → {F G : Typ (Γ , A₁ , ≃ A₂ t₂ (` A₂ z)) d₀}  → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F
                                                       → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ G
                                                       → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F ≡ G
         → {f : Trm Γ d₀}                              → Γ ⊢ f ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
         → {u : Trm Γ +0d}                             → Γ ⊢ u ∷ A₁
         → {p : Trm Γ -1d}                             → Γ ⊢ p ∷ ≃ A₁ t₁ u
         → A₁ [ wkn A₁ ] ≅ A₂
         → t₁ [ wkn A₁ ] ≅ t₂
         → Γ ⊢ ≃ind A₁ A₂ t₁ t₂ F f u p
             ≡ ≃ind A₁ A₂ t₁ t₂ G f u p
             ∷ F [ sub u , _ ] [ sub p ]
  ≃ind₆  : {d₀ : Dim}
         → {Γ : Ctx}                                   → Γ ⊢
         → {A₁ : Typ Γ +0d}                            → Γ ⊢ A₁
         → {A₂ : Typ (Γ , A₁) +0d}                     → Γ , A₁ ⊢ A₂
         → {t₁ : Trm Γ +0d}                            → Γ ⊢ t₁ ∷ A₁
         → {t₂ : Trm (Γ , A₁) +0d}                     → Γ , A₁ ⊢ t₂ ∷ A₂
         → {F : Typ (Γ , A₁ , ≃ A₂ t₂ (` A₂ z)) d₀}    → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F
         → {f g : Trm Γ d₀}                            → Γ ⊢ f ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
                                                       → Γ ⊢ g ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
                                                       → Γ ⊢ f ≡ g ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
         → {u : Trm Γ +0d}                             → Γ ⊢ u ∷ A₁
         → {p : Trm Γ -1d}                             → Γ ⊢ p ∷ ≃ A₁ t₁ u
         → A₁ [ wkn A₁ ] ≅ A₂
         → t₁ [ wkn A₁ ] ≅ t₂
         → Γ ⊢ ≃ind A₁ A₂ t₁ t₂ F f u p
             ≡ ≃ind A₁ A₂ t₁ t₂ F g u p
             ∷ F [ sub u , _ ] [ sub p ]
  ≃ind₇  : {d₀ : Dim}
         → {Γ : Ctx}                                   → Γ ⊢
         → {A₁ : Typ Γ +0d}                            → Γ ⊢ A₁
         → {A₂ : Typ (Γ , A₁) +0d}                     → Γ , A₁ ⊢ A₂
         → {t₁ : Trm Γ +0d}                            → Γ ⊢ t₁ ∷ A₁
         → {t₂ : Trm (Γ , A₁) +0d}                     → Γ , A₁ ⊢ t₂ ∷ A₂
         → {F : Typ (Γ , A₁ , ≃ A₂ t₂ (` A₂ z)) d₀}    → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F
         → {f : Trm Γ d₀}                              → Γ ⊢ f ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
         → {u ω : Trm Γ +0d}                           → Γ ⊢ u ∷ A₁
                                                       → Γ ⊢ ω ∷ A₁
                                                       → Γ ⊢ u ≡ ω ∷ A₁
         → {p : Trm Γ -1d}                             → Γ ⊢ p ∷ ≃ A₁ t₁ u
         → A₁ [ wkn A₁ ] ≅ A₂
         → t₁ [ wkn A₁ ] ≅ t₂
         → Γ ⊢ ≃ind A₁ A₂ t₁ t₂ F f u p
             ≡ ≃ind A₁ A₂ t₁ t₂ F f ω p
             ∷ F [ sub u , _ ] [ sub p ]
  ≃ind₈  : {d₀ : Dim}
         → {Γ : Ctx}                                   → Γ ⊢
         → {A₁ : Typ Γ +0d}                            → Γ ⊢ A₁
         → {A₂ : Typ (Γ , A₁) +0d}                     → Γ , A₁ ⊢ A₂
         → {t₁ : Trm Γ +0d}                            → Γ ⊢ t₁ ∷ A₁
         → {t₂ : Trm (Γ , A₁) +0d}                     → Γ , A₁ ⊢ t₂ ∷ A₂
         → {F : Typ (Γ , A₁ , ≃ A₂ t₂ (` A₂ z)) d₀}    → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F
         → {f : Trm Γ d₀}                              → Γ ⊢ f ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
         → {u : Trm Γ +0d}                             → Γ ⊢ u ∷ A₁
         → {p q : Trm Γ -1d}                           → Γ ⊢ p ∷ ≃ A₁ t₁ u
                                                       → Γ ⊢ q ∷ ≃ A₁ t₁ u
                                                       → Γ ⊢ p ≡ q ∷ ≃ A₁ t₁ u
         → A₁ [ wkn A₁ ] ≅ A₂
         → t₁ [ wkn A₁ ] ≅ t₂
         → Γ ⊢ ≃ind A₁ A₂ t₁ t₂ F f u p
             ≡ ≃ind A₁ A₂ t₁ t₂ F f u q
             ∷ F [ sub u , _ ] [ sub p ]

data _⊢ where
  [◆] : ◆ ⊢
  [,] : {d : Dim}
      → {Γ : Ctx} → Γ ⊢
      → {A : Typ Γ d} → Γ ⊢ A
      → Γ , A ⊢

data _⊢_ where
  -- minimal dependent type theory
  [Π] : {d₀ d₁ : Dim}
      → {Γ : Ctx}            → Γ ⊢
      → {A : Typ Γ d₀}       → Γ ⊢ A
      → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
      → Γ ⊢ Π A F
  [U] : {d : Dim}
      → {Γ : Ctx} → Γ ⊢
      → Γ ⊢ U d
  [E] : {d : Dim}
      → {Γ : Ctx}       → Γ ⊢
      → {t : Trm Γ +0d} → Γ ⊢ t ∷ U d
      → Γ ⊢ E d t

  -- equality
  [≃] : {Γ : Ctx}       → Γ ⊢
      → {A : Typ Γ +0d} → Γ ⊢ A
      → {t : Trm Γ +0d} → Γ ⊢ t ∷ A
      → {u : Trm Γ +0d} → Γ ⊢ u ∷ A
      → Γ ⊢ ≃ A t u

data _⊢_∷_ where
  conv : {d : Dim}
       → {Γ : Ctx} → Γ ⊢
       → {A B : Typ Γ d} → Γ ⊢ A
                         → Γ ⊢ B
                         → Γ ⊢ A ≡ B
       → {t : Trm Γ d}
       → Γ ⊢ t ∷ A
       → Γ ⊢ t ∷ B
  [`] : {d : Dim}
      → {Γ : Ctx}     → Γ ⊢
      → {A : Typ Γ d} → Γ ⊢ A
      → {v : Var Γ d} → Γ ⊢ var-typ v ≡ A
      → Γ ⊢ ` A v ∷ A
      
  -- minimal dependent type theory
  [ƛ] : {d₀ d₁ : Dim}
      → {Γ : Ctx}            → Γ ⊢
      → {A : Typ Γ d₀}       → Γ ⊢ A
      → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
      → {f : Trm (Γ , A) d₁} → Γ , A ⊢ f ∷ F
      → Γ ⊢ ƛ A F f ∷ Π A F
  [·] : {d₀ d₁ : Dim}
      → {Γ : Ctx}            → Γ ⊢
      → {A : Typ Γ d₀}       → Γ ⊢ A
      → {F : Typ (Γ , A) d₁} → Γ , A ⊢ F
      → {f : Trm Γ d₁}       → Γ ⊢ f ∷ Π A F
      → {B : Typ Γ d₀}       → Γ ⊢ B
      → {t : Trm Γ d₀}       → Γ ⊢ t ∷ B
      → Γ ⊢ A ≡ B
      → Γ ⊢ · A F f B t ∷ F [ sub t ]

  -- equality
  [≃rfl] : {Γ : Ctx}       → Γ ⊢
         → {A : Typ Γ +0d} → Γ ⊢ A
         → {t : Trm Γ +0d} → Γ ⊢ t ∷ A
         → Γ ⊢ ≃rfl A t ∷ ≃ A t t
  [≃ind] : {d₀ : Dim}
         → {Γ : Ctx}                                   → Γ ⊢
         → {A₁ : Typ Γ +0d}                            → Γ ⊢ A₁
         → {A₂ : Typ (Γ , A₁) +0d}                     → Γ , A₁ ⊢ A₂
         → {t₁ : Trm Γ +0d}                            → Γ ⊢ t₁ ∷ A₁
         → {t₂ : Trm (Γ , A₁) +0d}                     → Γ , A₁ ⊢ t₂ ∷ A₂
         → {F : Typ (Γ , A₁ , ≃ A₂ t₂ (` A₂ z)) d₀}    → Γ , A₁ , ≃ A₂ t₂ (` A₂ z) ⊢ F
         → {f : Trm Γ d₀}                              → Γ ⊢ f ∷ F [ sub t₁ , _ ] [ sub (≃rfl A₁ t₁) ]
         → {u : Trm Γ +0d}                             → Γ ⊢ u ∷ A₁
         → {p : Trm Γ -1d}                             → Γ ⊢ p ∷ ≃ A₁ t₁ u
         → A₁ [ wkn A₁ ] ≅ A₂
         → t₁ [ wkn A₁ ] ≅ t₂
         → Γ ⊢ ≃ind A₁ A₂ t₁ t₂ F f u p
             ∷ F [ sub u , _ ] [ sub p ]

data _⊢_∷wkn : (Γ : Ctx) (σ : Wkn Γ) → Set
infix 4 _⊢_∷wkn

data _⊢_∷wkn where
  [wkn] : {d : Dim}
        → {Γ : Ctx}     → Γ ⊢
        → {A : Typ Γ d} → Γ ⊢ A
        → Γ ⊢ wkn A ∷wkn
  [,]   : {d : Dim}
        → {Γ : Ctx}     → Γ ⊢
        → {σ : Wkn Γ}   → Γ ⊢ σ ∷wkn
        → {A : Typ Γ d} → Γ ⊢ A
        → Γ , A ⊢ σ , A ∷wkn

data _⊢_∷sub : (Γ : Ctx) (σ : Sub Γ) → Set
infix 4 _⊢_∷sub

data _⊢_∷sub where
  [sub] : {d : Dim}
        → {Γ : Ctx}     → Γ ⊢
        → {A : Typ Γ d} → Γ ⊢ A
        → {t : Trm Γ d} → Γ ⊢ t ∷ A
        → Γ , A ⊢ sub t ∷sub
  [,]   : {d : Dim}
        → {Γ : Ctx}     → Γ ⊢
        → {σ : Sub Γ}   → Γ ⊢ σ ∷sub
        → {A : Typ Γ d} → Γ ⊢ A
        → Γ , A ⊢ σ , A ∷sub

data _⊢_∷rew : (Γ : Ctx) (σ : Rew Γ) → Set
infix 4 _⊢_∷rew

data _⊢_∷rew where
  [rew] : {d : Dim}
        → {Γ : Ctx}       → Γ ⊢
        → {A B : Typ Γ d} → Γ ⊢ A
                          → Γ ⊢ B
                          → Γ ⊢ B ≡ A
        → Γ , A ⊢ rew A B ∷rew
  [,]   : {d : Dim}
        → {Γ : Ctx}     → Γ ⊢
        → {σ : Rew Γ}   → Γ ⊢ σ ∷rew
        → {A : Typ Γ d} → Γ ⊢ A
        → Γ , A ⊢ σ , A ∷rew
